In [1]:
import pandas as pd
pd.Series([7,3,5,8])

0    7
1    3
2    5
3    8
dtype: int64

In [7]:
x=pd.Series([7,3,5,8], index=['서울','대구','부산','광주'])
print(x)
x['서울']

서울    7
대구    3
부산    5
광주    8
dtype: int64

7

In [3]:
x[['서울','대구']]

서울    7
대구    3
dtype: int64

In [9]:
type(x)

pandas.core.series.Series

In [10]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [11]:
print(sorted(x.index))

['광주', '대구', '부산', '서울']

In [12]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [13]:
x = x.reindex(sorted(x.index))

In [14]:
x

광주    8
대구    3
부산    5
서울    7
dtype: int64

In [16]:
x= pd.Series([3,8,5,9], index=['서울','대구','부산','광주'])
y= pd.Series([2,4,5,1], index=['대구','부산','서울','대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [19]:
medal = [1,3,2,4,2,3]
x=pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [23]:
data = {'age' : [23,43,12,45],
        'name' : ['민준','현우','서연','동현'],
        'height' : [175.3,180.3, 165.8, 172.7]}
x = pd.DataFrame(data,columns = ['name','age','height'])
x

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7

In [52]:
print(x.mean(axis=0))

age        30.750
height    173.525
dtype: float64

In [31]:
counts = {'홍':3,'김':2,'이':5}
a = {v:k for k,v in counts.items()}
a[max(a.keys())]

'이'

In [36]:
ary = [[1,2],[3,4],[5,6]]
data = pd.DataFrame(ary,columns=['First','Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6

In [37]:
data.iloc[1]

First     3
Second    4
Name: 1, dtype: int64

In [38]:
data.iloc[:,1]

0    2
1    4
2    6
Name: Second, dtype: int64

In [43]:
ary = [[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary,columns=['First','Second'])
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [44]:
data.tail(3)

   First  Second
2      5       6
3      7       8
4      9      10

In [46]:
data

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [45]:
bools = [False,True,True,False,True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [49]:
data[bools]

   First  Second
1      3       4
2      5       6
4      9      10

In [54]:
data = {'age' : [58,53,23,27],
        'name' : ['a','b','c','d'],
        'height' : [183,163, 173, 176]}
x = pd.DataFrame(data,columns = ['name','age','height'])
x

  name  age  height
0   우생   58     183
1   태옥   53     163
2   경민   23     173
3   희천   27     176

In [65]:
x.age

0    58
1    53
2    23
3    27
Name: age, dtype: int64

In [56]:
x.iloc[1]

name       태옥
age        53
height    163
Name: 1, dtype: object

In [66]:
x.iloc[1,1]

53

In [55]:
print(x.mean(axis=0))

age        40.25
height    173.75
dtype: float64